[
  {
    "year": 2019,
    "officers": [
      {
        "position": "Chair",
        "name": "Brian Harlow",
        "bio": "Brian Harlow is a junior Electrical & Computer Engineering major with a Physics minor and an honors concentration. In the past with Rowan IEEE Brian has served as an SGA Representative as well as Activities Chair on the eboard. Outside of engineering, Brian’s biggest hobbies are building PCs, ice hockey, and golf. Computers are a big passion of his and he hopes to find an internship that will help lead him into a career of computer hardware design or embedded systems engineering. He is beyond excited to be at the helm of such an established and respectable club as IEEE and looks forward to a future of building it to be even greater!"
      },
      {
        "position": "Vice Chair",
        "name": "Will Cronin",
        "bio": "Will is a Junior ECE with a minor in CS and an Honors Concentration. He has done much for Rowan IEEE, serving as the tournament chair in 2016-2017 and the secretary in 2017-2018. This year he hopes to keep his reputation as the coolest eboard member as he takes on the responsibility of vice-chair. Outside of IEEE, Will is well known as a smash player that's slightly above average. In addition, Will spends what free time he has playing intramural soccer, playing co-op/party games with friends or dealing with his addiction to caffeine."
      },
      {
        "position": "Secretary",
        "name": "Cameron Bendzynski",
        "bio": "Cameron Bendzynski is a junior Electrical & Computer Engineering major with a minor in Physics. He is also an active member of the tournament committee, and a proud Eagle Scout. When Cameron isn't busy PC gaming, he's procrastinating his assignments with tabletop games. He will be working with PSEG Nuclear this summer, and is looking to pursue a career in power and energy. Cameron is very excited for what IEEE has in store for this upcoming year."
      },
      {
        "position": "Treasurer",
        "name": "Allison Gracie",
        "bio": "Allison Gracie is a sophomore Mechanical Engineering major with a minor in Electrical/Computer engineering. As treasurer of IEEE, she works with the e-board and general members to make sure that the club uses its budget to its fullest potential (also - she is responsible for financing all the free pizza!). Outside of IEEE, Ally is involved with SWE, Admissions Ambassadors, Honors, and AIAA. Besides classes, homework, and clubs, she loves to draw, paint, and hang out with friends. She is excited to be a part of IEEE and help continue its reputation as one of the best clubs on campus!"
      },
      {
        "position": "Activities Chair",
        "name": "Olga Koturlash",
        "bio": "Olga Koturlash is a Mechanical Engineering Major at Rowan University. She has a passion for CAD and wants to specialize in Design Engineering. Olga currently works with Rowan IEEE as head of logistics for ProfHacks 2019 while co-leading SIGHT, the Special Interest Group on Humanitarian Technology. As Activities Chair, Olga is looking forward to organizing many of the events that help Rowan IEEE members grow together and form long-lasting friendships. She's excited to get more people involved in IEEE events and hopes to help the club grow."
      },
      {
        "position": "Philadelphia Section Representative",
        "name": "DJ Stahlberger",
        "bio": null
      },
      {
        "position": "Webmaster",
        "name": "John McAvoy",
        "bio": "John is a senior electrical and computer engineering major currently serving as Webmaster of Rowan IEEE. On his free time he likes tutoring, working on the RAS hexacopter, and doing full stack web development. John plans to pursue a career in software engineering."
      },
      {
        "position": "Public Relations Chair",
        "name": "Brian Costantino",
        "bio": "Brian Costantino is a freshman Electrical and Computer Engineer at Rowan University with an intended minor in Mathematics. Brian loves graphic design and marketing, and he is passionate about pursuing a career in Aerospace Engineering. Brian spends his time playing the piano, singing, working out, and going snowboarding, as well as being heavily involved with Profhacks 2019. He is thrilled to be IEEE’s Public Relations Chair and is looking forward to the upcoming years with the club."
      },
      {
        "position": "Sponsorship Chair",
        "name": "Brody Eller",
        "bio": null
      },
      {
        "position": "Service Chair",
        "name": "Fowad Sohail",
        "bio": "Fowad Sohail is a sophomore Electrical and Computer Engineering major with a minor in Computer Science. Fowad is also a Lead Organizer of ProfHacks 2019, and served as an SGA representative last year. In his free time, Fowad's hobbies include: watching sports, learning about technology and working out. He is a huge soccer fan and loves Arsenal FC. His biggest assets are his tenacity, leadership and his sense of humor. Fowad is very goal oriented person and aspires to make a name for himself, Rowan University and IEEE on a wider stage. He hopes to secure an internship in software or hardware design in the coming years and hopes that IEEE can help him reach his goals."
      },
      {
        "position": "Tournament Chair",
        "name": "Nick Kabala",
        "bio": "Nick Kabala is currently a sophomore majoring in Electrical & Computer Engineering here at Rowan. If you manage to catch him when he isn't indulging himself in his studies, you'll most likely find him golfing, playing video games, or brainstorming new games that can be played in a tournament-style setting. With his previous experience as a tournament operator (TO) in his hometown, Nick plans to use his laid back personality and have-fun mentality to contribute towards making IEEE's Gaming Tournaments some of the best the organization has ever held. Nick's paramount goals during his term are to dethrone Vice Chair Will Cronin as IEEE's \"Smash God\", and of course to bring all members together in an environment where they can have fun and be themselves."
      },
      {
        "position": "Fundraising Chair",
        "name": "Kyle Fisher",
        "bio": "Kyle Fisher is a sophomore Mechanical Engineering major with an intended minor in Astronomy. One day, he plans to combine his two interests and specialize in Astronautical Engineering. This is his first year as fundraising co-chair in IEEE, and doesn't plan on it being his last. Working with Isiah, he is excited to help the Rowan IEEE to continue providing endless fun. Contact: fisherk5@students.rowan.edu"
      },
      {
        "position": "SGA Representative",
        "name": "Kevin O'Hare",
        "bio": "Kevin O’Hare is a Junior Electrical and Computer Engineering Major who has been an active member of IEEE since his freshman year. In the past Kevin has served on the planning committees for SAC 2017 and ProfHacks 2018. Kevin currently serves as a co-lead organizer for ProfHacks 2019. For his first eboard position, Kevin is excited to serve as one of the SGA Representatives for IEEE. In his free time, Kevin enjoys playing video games and hanging out with his friends. He is a huge fan of Philadelphia sports teams. Kevin has interests in renewable energy, electric cars, and systems engineering. He hopes his involvement with IEEE will allow him to form new connections in his field."
      },
      {
        "position": "SGA Representative",
        "name": "Karlie Naphy",
        "bio": "Karlie is a junior Electrical & Computer Engineering major with a minor in German Studies who's been involved in IEEE since her freshman year. After being part of the web committee, and then a year as the club's treasurer, Karlie is excited to continue her commitment to IEEE as an SGA Representative. She is also a member of IEEE's sister club Women in Engineering where she is currently the PR Chair. When she has time away from class and homework, she enjoys playing intramural soccer, going to trivia nights in the area, hanging out with friends, and, of course, napping to catch up on sleep whenever she gets the chance."
      },
      {
        "position": "SGA Representative",
        "name": "Christopher Satriale",
        "bio": null
      }
    ]
  },
  {
    "year": 2018,
    "officers": [
      {
        "position": "Chair",
        "name": "Jason Fisch",
        "bio": "Jason Fisch is a junior mechanical engineering major with a love for robotics and innovation. When Jason is not leading the best club on campus, you can find him hiking in national parks and working on his start-up. Jason is very excited to be serving his fellow students as the Chair of Rowan IEEE and organizer of the Rowan Idea Challenge. Previously, Jason served as the Philadelphia Section Student Representative and ProfHacks co-lead. Jason had an amazing time working for Stanley Black and Decker in Towson, Maryland as a Electromechanical Engineering Intern in the Global Tools & Storage division (GTS). Jason is in the process of starting a Formula Electric clinic project at Rowan. Finally, Jason can’t wait to see all the awesome things Rowan IEEE will accomplish this year!"
      },
      {
        "position": "Vice Chair",
        "name": "Nikola Kosaric",
        "bio": "Nikola Kosaric is a Junior Electrical and Computer Engineering Major with a love for technology and cars. He also served as a co-lead organizer of Profhacks 2018 and as the former Rowan IEEE co-activities chair. As Vice Chair, Nikola is excited to bring the club to new heights and show all engineering majors what the club can offer. When he isn’t dedicating his time towards IEEE or Profhacks, Nikola can be found wrenching on cars or disassembling whatever electronics can be found lying around. Nikola enjoyed his internship with LockHeed Martin RMS in Moorestown and hopes to pursue a job at Tesla in the future to combine both his passion for cars and technology."
      },
      {
        "position": "Secretary",
        "name": "Will Cronin",
        "bio": "Will is a junior Electrical and Computer Engineering major with a minor in computer science. He is also the former Rowan IEEE Tournament Chair from 2017. Will is dedicated to his work in IEEE but is also very laid back. He enjoys putting off his class assignments to feed his video game addiction. When he isn't indulging in gaming or rushing to complete his previously mentioned assignments, he can be found playing the sax, fooling around on photoshop, or occasionally rock climbing. Will is probably best known for his love for gaming and being a spicy meme lord. He is really excited to be more involved in Rowan IEEE this year, especially with the amazing eboard present."
      },
      {
        "position": "Treasurer",
        "name": "Karlie Naphy",
        "bio": "Karlie Naphy is a junior Electrical and Computer Engineering major with a minor in German Studies. While also a member of the college’s Women in Engineering club, Karlie focuses most of her time with IEEE, managing reimbursements and advocating for more girls to join the club and the field. You’ll most likely find her in Engineering Hall in line for a bagel, or napping in her apartment between classes. She’s super psyched to be on the E-board this year for IEEE and is excited to be working with everyone in the E-board and in the club."
      },
      {
        "position": "Activities Chair",
        "name": "Brian Harlow",
        "bio": "Brian Harlow is a junior year ECE major working on a Physics minor and an honors concentration. Inside of IEEE, Brian is working to help plan ProfHacks 2018 as lead of the Logistics Committee. He is very excited to be a part of the team that helps to bring the community all of the amazing opportunities that IEEE has to offer! As Activities Chair, Brian is very excited to bring all of IEEE’s amazing events to life for another year whether it be already established events like SUMO or new projects to be developed. In his personal time, Brian likes to play hockey, golf, and video games. Computers are a big passion of his, and in the future he hopes to work with companies like Intel or AMD and form a career in computer hardware design. He sees IEEE as a fantastic club and community upon which he can begin his path toward reaching his goals, and looks forward to all the good times to come with the club."
      },
      {
        "position": "Philadelphia Section Representative",
        "name": "DJ Stahlberger",
        "bio": null
      },
      {
        "position": "Webmaster",
        "name": "Philip Quinn",
        "bio": "Phil is a senior Electrical and Computer Engineering and Computer Science dual major with a minor in Mathematics. He loves to get involved with IEEE's Sumo Robitcs Competitions as well as ProfHacks every year. His professional interests include Machine Learning and Software Engineering. He is excited to now be on the e-board, and even more excited to be its Webmaster."
      },
      {
        "position": "Public Relations Chair",
        "name": "Quinn McHugh",
        "bio": "Quinn McHugh, also known as \"Q-tip\", \"The Mighty Quinn\", or \"Quinn the Eskimo\", is an honors senior mechanical engineering major with a minor in computer science who is excited to serve as the public relations chair of Rowan IEEE for the second year in a row. When he's not designing eye poppin' banners, t-shirts, and banners for the student chapter or maintaining the Rowan IEEE social media pages, Quinn works as a resident assistant at the Whitney Center and is passionate about snowboarding, cycling, and climate change. Last summer, Quinn worked as a VBA developer for a water utility company called Ridgewood Water and hopes to pursue a career in the sustainable energy or product design industry."
      },
      {
        "position": "Sponsorship Chair",
        "name": "Neeve Kadosh",
        "bio": "Neeve Kadosh is a sophomore Electrical and Computer Engineer with a minor in Physics at Rowan University. Neeve is addicted to networking and believes self driving cars are the future. He is passionate about pursuing a career at Google and has even attached his resume: https://tinyurl.com/y9dbkftm. Neeve has spent most of his life loving soccer, traveling, playing the violin, and going snowboarding. He is thrilled to be IEEE’s first ever Sponsorship Chair and is looking forward to the next four years with the club."
      },
      {
        "position": "Service Chair",
        "name": "John McAvoy",
        "bio": "John is a senior electrical and computer engineering major currently serving as service chair of Rowan IEEE. On his free time he likes tutoring, working on the RAS hexacopter, and doing web development. John plans to pursue a career in software engineering."
      },
      {
        "position": "Tournament Chair",
        "name": "Nate Hoffman",
        "bio": "Nate enjoys being a junior honors student in the Electrical and Computer Engineering program, where he loves learning new skills to add to his toolbox. By day, helping other students with projects and working on homework occupy his time. By night, Nate is always working on developing large-scale software using techniques learned both inside and outside the classroom. As tournament chair, he is slowly stepping into more formal leadership positions, and hopes to help make the Rowan IEEE student branch even better."
      },
      {
        "position": "Fundraising Co-Chair",
        "name": "Kyle Fisher",
        "bio": "Kyle Fisher is a sophomore Mechanical Engineering major with an intended minor in Astronomy. One day, he plans to combine his two interests and specialize in Astronautical Engineering. This is his first year as fundraising co-chair in IEEE, and doesn't plan on it being his last. Working with Isiah, he is excited to help the Rowan IEEE to continue providing endless fun. Contact: fisherk5@students.rowan.edu"
      },
      {
        "position": "Fundraising Co-Chair",
        "name": "Isaiah Salazar",
        "bio": "Isaiah Salazar is a sophomore Electrical and Computer Engineering major who is happy to serve as a Fundraising Co-Chair this year. Isaiah interned at Rowan's Virtual Lab over the summer and is currently interning at Rowan's Center for Research and Education in Advanced Transportation Engineering Systems. He first got involved with IEEE at this year's Sumo Robotics competition and excited to contribute to the club further as a member of the executive board."
      },
      {
        "position": "SGA Representative",
        "name": "Sean Prendergast",
        "bio": "Sean Prendergast is a sophomore Electrical & Computer Engineering Major and is also currently serving as one of IEEE’s SGA Representatives. Although he commutes from Blackwood NJ, he usually finds himself spending most of his time on campus anyway, as he has enjoyed every second of being an ECE at Rowan. He’s often found working on projects or homework with his fellow peers or just having a good time hanging out with all his friends. Outside of school, Sean enjoys sports, as well as working out, playing video games, watching movies and volunteering to help his community. Sean aspires to have a lasting impact on IEEE through his role as an SGA representative and is looking forward to having a phenomenal year with IEEE. He hopes that one day he’ll be able to inspire people to just be themselves and to never be afraid of chasing their goals and taking risks, he is also aiming to start his own business one day."
      },
      {
        "position": "SGA Representative",
        "name": "Kieran O'Connor",
        "bio": "Kieran O’Connor is a junior Electrical and Computer Engineering student and an SGA representative for IEEE. He has been apart of Activities Committee for IEEE and Fundraising Committee for the Rowan Fishing Team. Kieran has an interest in clean renewable energies and is using his position to get more involved in the organization."
      },
      {
        "position": "SGA Representative",
        "name": "Fowad Sohail",
        "bio": "Fowad Sohail is a sophomore Electrical and Computer Engineering major with a minor in Computer Science. Fowad is active in ProfHacks and serves as the head of the web committee. In addition, he has volunteered at many IEEE events, including the Sumo Robotics Competitions. He will serve as an SGA Rep in the coming semesters. In his free time, Fowad's hobbies include: watching sports, learning about technology and working out. He is a huge soccer fan and loves Arsenal FC. With this comes an intense hate for Tottenham Hotspur and Manchester United. His biggest assets are his tenacity, leadership and his sense of humor. Fowad is very goal oriented and aspires to make a name for himself, Rowan University and IEEE on a wider stage. He hopes to secure an internship in software or hardware design in the coming years and hopes that IEEE can help him reach his goals."
      }
    ]
  },
  {
    "year": 2017,
    "officers": [
      {
        "position": "Chair",
        "name": "Aaron Yangello",
        "bio": "Since the dawn of time, Aaron has been a curious fellow. As a lad, he was constantly exploring places unknown to him, vast places full of wonder and imagination. He often could be found inventing new ways to slay a dragon or save a kingdom from an evil ruler. As Aaron grew older, so too did his ambitions. Though he looked at the world through a more realistic eye, the colors of his imagination only grew more vivid. He was able to hone his skills in the art of creativity and innovation with such a bold and unique mind, shaping his work ethic and leadership.Aaron currently works as the Instrumentation Manager for the ECE Resource Center and serves as the Chair of Rowan IEEE. Outside of Rowan, he works as a Software Development Intern at Innovative Defense Technologies and a Mathematics Tutor at Salem Community College. When he's not working, he volunteers his time tutoring others in the STEM fields and integrating technology in the daily lives of the elderly. After graduation, Aaron hopes to pursue a career in electronics hardware development and start a family. His passion for learning and teaching is only rivaled by his love of people and helping others succeed."
      },
      {
        "position": "Vice Chair",
        "name": "Chris Dietch",
        "bio": "Chris is a junior year ECE major with a minor in computer science. Since transferring from Burlington County College, he has been heavily involved in many of IEEE's programs and events, most notably his work on Rowan's annual hackathon, ProfHacks. He is interested in many of the computer-related aspects of the major, including processor architecture and software design. He hopes to one day work with emerging technologies such as resistive or quantum computing. While Chris does not currently have an internship, he hopes employers will read this bio and see that he is hard working and ambitious, and would be an extremely valuable asset to any team. He is incredibly proud to be a part of IEEE, and is thrilled to have the opportunity to make a positive impact on the world through his position with the organization."
      },
      {
        "position": "Secretary",
        "name": "Jess Sesko",
        "bio": "Jess is an honors junior Electrical and Computer Engineering major, and the secretary of the Rowan IEEE Students Branch. She is also the vice president of the IEEE sub-branch WIE. Jess interns at Lockheed Martin in Moorestown as a College Student Technical Specialist. She is interested in media production and sensor development, and hopes to learn more about these applications throughout her education and professional career experience."
      },
      {
        "position": "Treasurer",
        "name": "Sean Hastings",
        "bio": "Sean Hastings is a sophomore Electrical and Computer Engineering major with a minor in Computer Science and a concentration in Honors. He has recently secured an internship within Lockheed Martin’s Rotary and Mission Systems as a Radar Systems Engineer. Previously, Sean worked as an IT intern for IEEE at its Operations Center in Piscataway, NJ. He hopes to continue his education after graduation, pursuing a Master’s in Electrical and Computer Engineering. Within IEEE, Sean is involved in several committees such as SAC and ProfHacks, and hopes to make a positive impact as Treasurer."
      },
      {
        "position": "Co-Activities Chair",
        "name": "Nikola Kosaric",
        "bio": "Nikola Kosaric is a freshman Electrical and Computer Engineering major. With prior high school robotics experience, Nikola plans to start a VEX U robotics team at Rowan with fellow students. He has participated in the sumo robotics competition and is involved with sponsorship for ProfHacks 2017. Nikola hopes to secure an internship at Tesla Motors in the future and plans to pursue a career within the automotive industry."
      },
      {
        "position": "Co-Activities Chair",
        "name": "DJ Stahlberger",
        "bio": "DJ Stahlberger is a freshmen Electrical and Computer Engineering Major. He is currently the Activities Co-Chair along with Nikola Kosaric. He helped with ProfHacks 2017 as a member of the Hacker Experience Committee. Outside of IEEE DJ loves to snowboard, play tennis, play video games, and work at his part-time job at an ice cream stand. He plans to pursue an internship at Atlantic City Electric and looks forward to a possible career with them. He was very adamant about joining IEEE and looks forward to his future with IEEE."
      },
      {
        "position": "Philadelphia Section Representative",
        "name": "Jason Fisch",
        "bio": "Jason is a sophomore Mechanical Engineering major with a minor in mathematics. Since freshman year, Jason has been very active in the Rowan IEEE student branch. As a freshman, he led the ProfHacks sponsorship committee and competed in sumobot competitions. More recently, Jason holds the IEEE Philadelphia Section Student Representative position, where he ensures the continuing success of all IEEE Philly student branches. Jason is the lead organizer of ProfHacks which enables students to apply knowledge learned in class. He is very fortunate to be a leader in IEEE. He is in the process of starting his own clinic project at Rowan. Jason hopes NASA, SpaceX and Apple will read this bio and hire him on the spot!"
      },
      {
        "position": "Webmaster",
        "name": "Chris Green",
        "bio": "Chris is a junior Electrical and Computer Engineering major, and the former Rowan IEEE treasurer from 2015-2016. He's interested in hardware development, embedded systems, and music electronics. He has an internship at Lockheed Martin in their Spectrum Systems Laboratory working with software defined radio, machine learning, and massively parallel computing platforms. Within Rowan IEEE, Chris does a little of everything. In his free time he studies percussion in Rowan's music department."
      },
      {
        "position": "Public Relations Chair",
        "name": "Quinn McHugh",
        "bio": "Quinn McHugh is an Honors sophomore mechanical engineering major with a minor in computer science. He is currently serving as the Rowan IEEE Public Relations Chair, where he designs eye-poppin' flyers, t-shirts, and logos for the chapter, and works as a resident assistant at the Whitney Center. Quinn is interested in pursuing a career in renewable energy or sustainable product design and is excited to begin an internship with Ridgewood Water this summer. In his free time, he loves to snowboard, mountain bike, play guitar, and get outside his comfort zone."
      },
      {
        "position": "Tournament Chair",
        "name": "Will Cronin",
        "bio": "Will is an honors freshman Electrical and Computer Engineering major with a minor in computer science. Besides being a skilled saxophonist, Will is also an experienced gamer, having talents ranging from Pokémon to League. He decided to join IEEE after participating in the Prof-bot competition that the club hosted. When he’s not gaming, Will enjoys writing/playing music, running, and sleeping."
      },
      {
        "position": "Fundraising Chair",
        "name": "Sam Yuen",
        "bio": "Sam is a transfer student from Atlantic Cape Community College. He is majoring in Electrical and Computer Engineering with a minor in Computer Science. He is currently serving in the New Jersey Air National Guard as an Aircraft Electrical and Environmental Specialist. Sahm also works as an assistant at the ECE Tech Office. He is a member of IEEE and a member of Rowan University IEEE student branch. He enjoys working on projects both in and out of school, and his goal to create his own company."
      },
      {
        "position": "SGA Representative",
        "name": "RJ Weld",
        "bio": "RJ Weld is a junior Electrical and Computer Engineering major at Rowan University. He is also on committees for Rowan's 2017 IEEE hackathon called ProfHacks and IEEE's region 2 Student Activities Committee (SAC). In his free time, RJ enjoys hanging out with friends, working out, playing sports and playing video games. RJ loves attending Rowan University and joined his student branch's IEEE e-board to help further the advancement of the school and its ECE program."
      },
      {
        "position": "SGA Representative",
        "name": "Brian Harlow",
        "bio": "Brian Harlow is a sophomore ECE major working on a Physics minor and an honors concentration. Inside of IEEE, Brian is working to help plan ProfHacks 2018 as lead of the Logistics Committee. He is very excited to become part of the team that helps to bring the community all of the amazing opportunities that IEEE has to offer! In his personal time, Brian likes to play hockey, golf, and video games. Computers are a big passion of his, and in the future he hopes to work with companies like Intel and form a career in computer hardware design. He sees IEEE as a fantastic club and community upon which he can begin his path toward reaching his goals, and looks forward to all the good times to come with the club."
      },
      {
        "position": "SGA Representative",
        "name": "Peter Awolumate",
        "bio": "Peter Awolumate is an ECE major and a transfer student from Rowan college of Burlington county. He loves so many sports, especially soccer. Peter wants to learn how to swim, but he is scared of water. In addition, he is a compassionate person so his dream is to serve the less privileged in all nations all over the world. Lastly and most crucial he is passionate about God!"
      },
      {
        "position": "SGA Representative",
        "name": "Kevin Beenders",
        "bio": "Kevin Beenders is a Sophomore ECE major, and one of the IEEE SGA reps. Kevin is also a member of the activities committee for IEEE and assists in planning events such as ProfHacks 2018. Kevin is also a mentor in the IEEE mentorship program. In his spare time, Kevin enjoys Fishing, Improving his guitar skills, volunteering, helping others and having a good time out with friends. Kevin wishes to make a positive impact through his position as SGA rep and make Rowan a continually better place to live and receive an education."
      }
    ]
  },
  {
    "year": 2016,
    "officers": [
      {
        "position": "Chair",
        "name": "Jacob Culleny",
        "bio": "Jake from State Farm is a sophomore ECE with an Honors concentration. Contrary to the State Farm commercial, Jake currently works at the FAA Technical Center as a Systems Integration and Test Engineer. He and his team work on Data Communication, a FAA program which will revolutionize the way Air Traffic Controllers communicate with Pilots. In addition to IEEE, Jake recently became an NJ state certified EMT and actively rides on Rowan’s student-run EMS squad. He is a motivated and hardworking student, and looks forward to leaving a positive impact in Rowan IEEE."
      },
      {
        "position": "Vice Chair",
        "name": "Raymond Linden",
        "bio": "Ray Linden is a sophomore electrical & computer engineering major with a minor in computer science. He is currently serving as the Rowan IEEE student branch's Vice Chair and the IEEE Philadelphia Section student representative. Ray is currently perusing a career in the power and energy industry but is also interested in automation technology and technical sales. When Ray is not doing school work, planning IEEE events, or helping underclassman expand their network or land an internship, he enjoys reading about advances in technology in aerospace and space travel. After college Ray will begin training to obtain his private pilot's license."
      },
      {
        "position": "Secretary",
        "name": "Alexander Frederick",
        "bio": "Alexander Frederick is a freshman electrical and computer engineering major who was elected as the IEEE secretary. He is interested in studying power distribution or advanced networking and distributed cloud computing. He is currently working with a company designing systems for drone performances and choreography. In his spare time, he enjoys camping, skiing, sailing, and building computers."
      },
      {
        "position": "Treasurer",
        "name": "Chris Green",
        "bio": "Chris is a sophomore Electrical and Computer Engineering major and a physics minor. He's interested in hardware development, embedded systems, and music electronics. He has an internship at Lockheed Martin in their Spectrum Systems Laboratory working with software defined radio and massively parallel computing platforms. Within Rowan IEEE, he has volunteered at several events and competitions, and is also a peer mentor and tutor. In his free time he studies percussion in Rowan's music department."
      },
      {
        "position": "Activities Chair",
        "name": "Seamus Plunkett",
        "bio": "Chris is a sophomore Electrical and Computer Engineering major and a physics minor. He's interested in hardware development, embedded systems, and music electronics. He has an internship at Lockheed Martin in their Spectrum Systems Laboratory working with software defined radio and massively parallel computing platforms. Within Rowan IEEE, he has volunteered at several events and competitions, and is also a peer mentor and tutor. In his free time he studies percussion in Rowan's music department."
      },
      {
        "position": "Webmaster",
        "name": "Nick Felker",
        "bio": "Nick is a junior Electrical and Computer Engineering major with a Computer Science minor. He has been very involved with IEEE since a freshman. He helped plan the sumo robotics competition and was an organizer lead for the first year of ProfHacks."
      },
      {
        "position": "Public Relations Co-Chair",
        "name": "Austin O'Neill",
        "bio": null
      },
      {
        "position": "Public Relations Co-Chair",
        "name": "Jessica Sesko",
        "bio": "Jessica is an honors sophomore Electrical and Computer engineering student. She is the Public Relations Chair, alongside Torrie Griffiths and Austin O'Neill. Involved with other engineering clubs on campus, Jess is also the founding secretary of IEEE WIE (Women in Engineering). In addition to advertising IEEE to the students of Rowan, she is also working toward the success of WIE. Jess hopes to further her knowledge in electronics and computers somewhere in the future."
      },
      {
        "position": "Public Relations Co-Chair",
        "name": "Torrie Griffths",
        "bio": "Torrie is currently a sophomore Mechanical Engineering student with concentrations in Honors Studies and Systems Engineering. Last summer, she interned as a design engineer at Holtec International in Marlton, New Jersey. Currently for IEEE, Torrie photographs events and advertises IEEE to other students. Torrie is also the founding chair of Rowan's IEEE Women in Engineering Student Branch, which provides tutorials for practical, interdisciplinary engineering skills. Contact Torrie with any questions at griffithv2@students.rowan.edu."
      },
      {
        "position": "Fundraising Chair",
        "name": "Sergiy Dovgopol",
        "bio": "Sergiy is a Mechanical Engineering major, who is currently completing his second semester as a Freshman. He is involved in ASME seminar sessions to polish his technical knowledge of SOLIDWORKS, and serves as an informal liaison between the two engineering societies. His ultimate goal is to receive an internship with either a government spaceflight agency, or a private spaceflight company."
      },
      {
        "position": "Tournament Chair",
        "name": "Matthew Rodriguez",
        "bio": "Matthew Rodriguez, born in Lucena City, Philippines on October 22nd, 1997, is the youngest of 3 children. His passion for computer science and engineering stems from his early middle school years playing Minecraft. He has wanted to join IEEE ever since he saw the club present their projects during the freshman orientation. He became the tournament chair by following the steps of and learning from his mentor, and close friend, Walter Marroquin."
      },
      {
        "position": "SGA Representative",
        "name": "Aaron Yangello",
        "bio": "Aaron (ECE) transferred from Salem Community College with an AA in Physics and Engineering. After completing his undergraduate degree, he hopes to continue his education, pursuing a Master’s in BioMedical Engineering and in Engineering Management. Aaron works as an ECE Technician’s Assistant, a youth counselor, a Mathematics Tutor at Salem Community College, a DJ for his own entertainment company, and a technology tutor for the elderly. Eventually, he hopes to build an army of stealthy drones that perform anonymous acts of kindness. Aaron is ecstatic to work with the members of IEEE to make Rowan better than even Henry Rowan could imagine."
      },
      {
        "position": "SGA Representative",
        "name": "Jake Clemetson",
        "bio": "Jake Clemetson is a sophomore Electrical and Computer Engineering major at Rowan. He currently lives in Rowan Boulevard Apartments and is from Tinton Falls, NJ. In his free time, he enjoys having fun with friends, playing video games, working out, running and playing sports. Jake works at the RCA Heritage Program Museum and is involved in IEEE, AIAA and SAME clubs. Also, he enjoys hiking/camping, listening to classic rock music and working on his car."
      },
      {
        "position": "SGA Representative",
        "name": "Alex Manofu",
        "bio": "Alex Manofu is a sophomore mechanical engineering major. She is involved in the new IEEE WIE Rowan chapter and currently serves as the co fundraising chair. This summer she will be working as an intern at IPS. She is excited to be a part of this year's IEEE eboard!"
      }
    ]
  },
  {
    "year": 2015,
    "officers": [
      {
        "position": "Chair",
        "name": "Daniel Cahall",
        "bio": "Daniel is currently a Sophomore Electrical and Computer Engineering major with a second major in Computer Science. He co-lead the International Sumo Robot Project, participated in planning the 2014 IEEE Student Activities Conference, and aided the previous chair in establishing an International Partnership with James Cook University in Australia. This past summer, he performed Robotics research for the Computer Science department and interned at the Virtual Reality Lab in the South Jersey Technology Park. This upcoming summer, he has accepted an offer to work with Innovative Defense Technologies. He hopes to enter a career in robotics or AI. Contact him at cahalld0@students.rowan.edu."
      },
      {
        "position": "Vice Chair",
        "name": "Matthew Whitley",
        "bio": "Matthew is a Junior Electrical and Computer Engineering undergraduate student at Rowan University, currently serving as the Vice Chair for IEEE. He has interned as a systems engineer at both the Federal Aviation Administration in Atlantic City, and at PSEG's Hope Creek Generating Station nuclear power plant, in Lower Alloways Creek. He is also a Resident Assistant in Rowan Boulevard. Within IEEE, Matt has helped organize countless activities, including the SUMO Bot competition he co-led last year, the 2014 SAC, and most notably, the Australian-American International Student Branch Exchange. Contact Matt with any questions here: whitleym0@students.rowan.edu."
      },
      {
        "position": "Secretary",
        "name": "Elijah Neville",
        "bio": "Elijah Neville is a sophomore Electrical and Computer Engineering major with a Computer Science minor. He enjoys spending his time with his friends and learning as much as he can. Eli lead the T-Shirt competition and the Friday Night Ice Breaker at IEEE Region 2 Students Activities Conference. Contact him at nevillee0@students.rowan.edu"
      },
      {
        "position": "Treasurer",
        "name": "James Ritchie",
        "bio": "James Ritchie III is a junior in the Electrical and Computer Engineering department, and is pursuing a minor in Computer Science and Mechanical Engineering. James currently works for the Federal Aviation Administration with the Concept Analysis Branch at the William J. Hughes Technical center, and is interesting in pursing a career in Aerospace Engineering. He currently works on a Genetic Algorithm for time shifting flights, and Massive Online Analysis for his machine learning engineering clinic. James has been an E-board member of Rowan?s IEEE since his freshman year, and continues to lend the club his expertise whenever needed."
      },
      {
        "position": "Activities Chair",
        "name": "Jacob Culleny",
        "bio": "Jake is currently finishing his freshman year as an Electrical and Computer Engineer with a concentration in the Bantivoglio Honors Program. With a substantial interest in Aeronautical Engineering, Jake is looking to intern this summer with Lockheed Martin, Gulfstream, or the FAA. He is a hardworking and self-motivated student that looks forward to becoming more involved with IEEE and other clubs at Rowan. You can contact him at cullenyj5@students.rowan.edu."
      },
      {
        "position": "Webmaster",
        "name": "Nick Felker",
        "bio": "Nick is a Sophomore Electrical and Computer Engineering major with a Computer Science minor. He has been very involved with IEEE, participating in the sumo robotics competition, engineering olympics, SAC, and now as the webmaster. He enjoys programming both for the web and Android. You can contact him at felkern0@students.rowan.edu."
      },
      {
        "position": "Fundraising Chair",
        "name": "Ray Linden",
        "bio": "Raymond is a Freshman Electrical and Computer Engineering major with a minor is Computer Science. He is aspiring to be a Resident Assistant next year and is starting an inventors club with fellow students. He is involved with AIAA and is currently on the blimp team. He hopes to secure an internship with Space-X sometime in the future and plans on perusing a career working on space related projects."
      },
      {
        "position": "Radio Committee",
        "name": "Matthew Oldland",
        "bio": "Matt is in his senior year of Electrical and Computer Engineering at Rowan University. He has been involved with IEEE since he was a freshman ECE. He has participated in the IEEE Student Activities Conference and the various robotics competitions held by IEEE. He is also a member of the Robotics and Automation Society at Rowan. He enjoys working with robotics and loves to work with both the hardware and programming side of engineering. He is currently trying to get the Amateur Radios up and running for the club to talk to the surrounding area and to the partner school in Australia."
      },
      {
        "position": "Tournament Chair",
        "name": "Walter Marroguin",
        "bio": "Walter is currently a Junior Electrical and Computer Engineering major with a Computer Science minor. He currently plans the gaming tournaments used to get students interested in IEEE activities. He is also a member of the Robotic Automation Society. Walter loves everything from video games to anime to coding to helping those in need. He hopes to eventually be involved in robotics."
      },
      {
        "position": "SGA Representative",
        "name": "Michael Paule",
        "bio": "Michael is currently a Sophomore Electrical and Computer Engineer with minors in both Physics and Computer Science. He is the current SGA representative for IEEE along with Stephanie Tan and Breanna Higgins and attends all Student Government meetings as well as the meetings for the Student Affairs Committee. He is a Lifeguard as well as an engineer and is currently interning with the Federal Aviation Administration in Atlantic City as a Electrical Engineer. If you have any ideas or concerns about student affairs feel free to e-mail Michael at paulem0@students.rowan.edu. He also wants you to have a fantastic day."
      },
      {
        "position": "SGA Representative",
        "name": "Stephanie Tan",
        "bio": "Stephanie is a sophomore electrical and computer engineering student. She is one of the SGA representatives for IEEE this year. She enjoys working with robots and hopes to pursue a career involving them. Stephanie's favorite thing to do I'd taking things apart and putting back together. If you have any ideas regarding student affairs you can contact her at tans0@students.rowan.edu."
      },
      {
        "position": "SGA Representative",
        "name": "Breanna Higgins",
        "bio": "Breanna Higgins is currently a freshman majoring in Electrical and Computer Engineering with a minor in Computer Science. She is a SGA representative for Rowan’s IEEE Student Branch. Breanna enjoys entering robotics competitions and utilizing her programming skills. In addition to engineering, Breanna also enjoys drawing and painting. You may contact Breanna at higginsb7@students.rowan.edu."
      }
    ]
  },
  {
    "year": 2014,
    "officers": [
      {
        "position": "Chair",
        "name": "Jeffrey Eker",
        "bio": "Jeffrey is a Sophomore Electrical and Computer Engineering major with a minor in German Studies and an IEEE PES Scholar. He has interned at NAVSEA for two summers as a SEAP and a STEP, and most recently worked at L-3 Communications / SPD Electrical Systems this past summer. For this coming summer, Jeffrey has accepted an offer to work with Lockheed Martin Space Systems."
      },
      {
        "position": "Vice Chair",
        "name": "Jonathan Whalen",
        "bio": "Jonathan is a senior electrical and computer engineering student. He enjoys tinkering with micro-controllers and taking things apart. He enjoys helping others and is involved greatly in the community. He likes to spend his free time with friends and playing any type of game. He is looking to work for a company who creates personal electronic devices, and maybe starting his own business. He is a kind and caring guy who can easily be approached with any problem and is happy to help. He is currently interning at Lockheed Martin for the summer of 2014 and Looking forward to his final year."
      },
      {
        "position": "Secretary",
        "name": "Maria Torculas",
        "bio": "Maria is a junior Electrical and Computer Engineering major – with a tentative minor in Physics –currently serving as Secretary of IEEE. She also serves as the Secretary of the Robotics and Automation Society (RAS) and the Vice President of the Rowan University Philippine-American Coalition (RUPAC). This summer, she interned at the Lockheed Martin Mission Systems and Training facility in Moorestown, NJ to support development of the Aegis Combat System and will be working in Rowan Hall’s IT department as a student technician for the duration of the school year."
      },
      {
        "position": "Treasurer",
        "name": "Nick Centrullo",
        "bio": "Nick is a Junior Sophomore Electrical and Computer Engineering major with a Systems Concentration. He has worked at Rowan University since he began studying there, and will intern with Lockheed Martin this summer. Nick was also the treasurer for the IEEE Region 2 Student Activities Conference of 2014."
      },
      {
        "position": "Activities Chair",
        "name": "Matthew Whitley",
        "bio": "Matthew is an Electrical Computer engineering undergraduate student at Rowan University, currently serving as the Activities Chair for IEEE. He has interned at the Federal Aviation Administration in Atlantic City as a student technician, and is pursuing a career at IBM in computer hardware. He will also be a Resident Assistant next year, and he is the president of Rowan's Ski and Snowboard Club."
      },
      {
        "position": "Webmaster",
        "name": "Samed Ozdemir",
        "bio": "Samed is currently a Senior Electical and Computer Engineering major with a Biomedical Enginering concentration. He enjoys working on embedded systems such as robtics and both computer software development and mobile application development in various programming languages. He looks towards to helping anyone with hardware and software development. He enjoys graphic and web design as a hobby, and his activities include soccer and and other sports."
      },
      {
        "position": "Fundraising Chair",
        "name": "Julie Park",
        "bio": "Julie is an electrical and computer engineering major with a minor in computer science and an honors concentration. She has previously interned with Concord Atlantic Engineers and in Voice Communications at The Federal Aviation Administration Technical Center. This summer, Julie has accepted an internship with Harris Corporation where she will work with software developers."
      },
      {
        "position": "Amateur Radio Lead",
        "name": "James Richie",
        "bio": "James is currently a Sophomore Electrical and Computer Engineering major with a minor in Computer Science. He is currently the Secretary of Rowan’s IEEE Student Branch, and is also involved) in Rowan’s Robotics and Automation Society (RAS). James loves computers, video games, and his friends. He hopes to enter a career in the Astronautical Engineering field building spaceships and satellites."
      },
      {
        "position": "Facilities Manager",
        "name": "Danny Cahall",
        "bio": "Danny is a sophomore Electrical and Computer Engineering major with a Computer Science minor. He is currently the Facilities Manager in IEEE. He is also involved with Robotics Automation Society. Danny loves comic books, old school video games, and working out. He hopes to enter a career involving robotics."
      },
      {
        "position": "SGA Representative",
        "name": "Michael Paule",
        "bio": "Michael is currently a Sophomore Electrical and Computer Engineer with minors in both Physics and Computer Science. He is the current SGA representative for IEEE and attends all Student Government meetings as well as the meetings for the Student Affairs Committee. He is a Lifeguard as well as an engineer and has interned with the Federal Aviation Administration in Atlantic City as a student technician. He also wants you to have a fantastic day."
      }
    ]
  }
]
